ХМНПФ_Общее/DataProcessors/уп_ПерерасчетПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПерерасчетПенсий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПараметрыПенсионногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПараметрыПенсионногоДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаУчастников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Единовременно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПоТребованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ПерерасчетПенсий/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Владелец КАК Договор
	|ПОМЕСТИТЬ вр_ТабВыплатныеСчета
	|ИЗ
	|	РегистрСведений.уп_СостоянияПС.СрезПоследних(&Дата, ) КАК уп_СостоянияПССрезПоследних
	|ГДЕ
	|	уп_СостоянияПССрезПоследних.Состояние = &Выплатное
	|	%ОтборОрганизация%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПериодичностьВыплатСрезПоследних.НомерСчета КАК НомерСчета
	|ПОМЕСТИТЬ вр_ИсключаемыеСчета
	|ИЗ
	|	РегистрСведений.уп_ПериодичностьВыплат.СрезПоследних(
	|			&Дата,
	|			НомерСчета В
	|					(ВЫБРАТЬ
	|						вр_ТабВыплатныеСчета.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ТабВыплатныеСчета КАК вр_ТабВыплатныеСчета)
	|				И ПериодичностьВыплат В (&ПериодичностьВыплатНеЕжемесячные)) КАК уп_ПериодичностьВыплатСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ТабВыплатныеСчета.НомерСчета КАК НомерСчета,
	|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.МинимальныйСрокВыплат КАК ШаблонДоговораМинимальныйСрокВыплат,
	|	уп_ПараметрыПенсионногоДоговораСрезПоследних.Схема КАК Схема
	|ПОМЕСТИТЬ вр_ПС
	|ИЗ
	|	вр_ТабВыплатныеСчета КАК вр_ТабВыплатныеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(&Дата, ) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
	|		ПО вр_ТабВыплатныеСчета.Договор = уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор
	|			И (уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ВозможностьПереводаСрочныхВыплатВВыплатыДоИсчерпания)
	|ГДЕ
	|	НЕ вр_ТабВыплатныеСчета.НомерСчета В
	|				(ВЫБРАТЬ
	|					вр_ИсключаемыеСчета.НомерСчета КАК НомерСчета
	|				ИЗ
	|					вр_ИсключаемыеСчета КАК вр_ИсключаемыеСчета)
	|;
	|
#Вставка
//++https://redmine.npf.com/issues/4274
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	СУММА(уп_СчетчикНачислений.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|		уп_СчетчикНачислений.Количество КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата, НомерСчета В (ВЫБРАТЬ
	|						вр_ПС.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПС КАК вр_ПС)) КАК хм_СрезСчетчик
	|			ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
	|				И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
	|	ГДЕ
	|		уп_СчетчикНачислений.Период <= &Дата
	|	    И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|						вр_ПС.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПС КАК вр_ПС)
	|		И хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		хм_СрезСчетчик.НомерСчета,
	|		хм_СрезСчетчик.Количество
	|	ИЗ
	|		РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата, НомерСчета В (ВЫБРАТЬ
	|						вр_ПС.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПС КАК вр_ПС)) КАК хм_СрезСчетчик
	|
	|) КАК уп_СчетчикНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СчетчикНачислений.НомерСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
//--https://redmine.npf.com/issues/4274
#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ПС.НомерСчета КАК НомерСчета,
	|	вр_ПС.ШаблонДоговораМинимальныйСрокВыплат - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК ОставшиесяВыплаты,
	|	вр_ПС.Схема КАК Схема,
	|	вр_ПС.ШаблонДоговораМинимальныйСрокВыплат КАК ШаблонДоговораМинимальныйСрокВыплат
	|ПОМЕСТИТЬ вр_ОставшиесяВыплаты
	|ИЗ
	|	вр_ПС КАК вр_ПС
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(
	|				,
	|				&Дата,
	|				,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						вр_ПС.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПС КАК вр_ПС)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	|		ПО вр_ПС.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
	|ГДЕ
	|	вр_ПС.ШаблонДоговораМинимальныйСрокВыплат - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ОставшиесяВыплаты.НомерСчета КАК НомерСчета,
	|	ЕСТЬNULL(уп_РезервыОстатки.СуммаОстаток, 0) / вр_ОставшиесяВыплаты.ОставшиесяВыплаты КАК РасчетныйРазмерПенсии,
	|	уп_СостоянияПССрезПервых.Период КАК НачалоВыплатногоПериода,
	|	вр_ОставшиесяВыплаты.Схема КАК Схема,
	|	вр_ОставшиесяВыплаты.ШаблонДоговораМинимальныйСрокВыплат КАК ШаблонДоговораМинимальныйСрокВыплат
	|ПОМЕСТИТЬ вр_ПС2
	|ИЗ
	|	вр_ОставшиесяВыплаты КАК вр_ОставшиесяВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы.Остатки(
	|				&Дата,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						вр_ОставшиесяВыплаты.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ОставшиесяВыплаты КАК вр_ОставшиесяВыплаты)) КАК уп_РезервыОстатки
	|		ПО вр_ОставшиесяВыплаты.НомерСчета = уп_РезервыОстатки.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПервых(
	|				,
	|				НомерСчета В
	|						(ВЫБРАТЬ
	|							вр_ОставшиесяВыплаты.НомерСчета КАК НомерСчета
	|						ИЗ
	|							вр_ОставшиесяВыплаты КАК вр_ОставшиесяВыплаты)
	|					И Состояние = &Выплатное) КАК уп_СостоянияПССрезПервых
	|		ПО вр_ОставшиесяВыплаты.НомерСчета = уп_СостоянияПССрезПервых.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ПС2.НомерСчета КАК НомерСчета,
	|	вр_ПС2.РасчетныйРазмерПенсии КАК РасчетныйРазмерПенсии,
	|	вр_ПС2.Схема КАК Схема,
	|	вр_ПС2.ШаблонДоговораМинимальныйСрокВыплат КАК МинимальныйСрокВыплат
	|ПОМЕСТИТЬ вр_ПС3
	|ИЗ
	|	вр_ПС2 КАК вр_ПС2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ОбщиеПенсионныеПравила.СрезПоследних(, Правило = &МинимальныйРазмерПенсии) КАК уп_ОбщиеПенсионныеПравилаСрезПоследних
	|		ПО вр_ПС2.НачалоВыплатногоПериода >= уп_ОбщиеПенсионныеПравилаСрезПоследних.Период
	|ГДЕ
	|	вр_ПС2.РасчетныйРазмерПенсии > ЕСТЬNULL(уп_ОбщиеПенсионныеПравилаСрезПоследних.Значение, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ПС3.НомерСчета КАК НомерСчета,
	|	вр_ПС3.РасчетныйРазмерПенсии КАК РазмерВыплаты,
	|	вр_ПС3.Схема КАК Схема,
	|	вр_ПС3.МинимальныйСрокВыплат КАК КоличествоВыплат,
	|	ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Ежемесячно) КАК ПериодичностьВыплат,
	|	уп_ЛицевыеСчетаУчастниковСрезПоследних.ФормаВыплаты КАК ФормаВыплаты,
	|	уп_ЛицевыеСчетаУчастниковСрезПоследних.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
	|	уп_ЛицевыеСчетаУчастниковСрезПоследних.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	|	уп_ЛицевыеСчетаУчастниковСрезПоследних.РасчетныйСчет КАК РасчетныйСчет,
	|	уп_ЛицевыеСчетаУчастниковСрезПоследних.Банк КАК Получатель,
	|	вр_ПС3.НомерСчета.Участник КАК Участник,
	|	вр_ПС3.НомерСчета.Владелец КАК ПенсионныйДоговор
	|ИЗ
	|	вр_ПС3 КАК вр_ПС3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаУчастников.СрезПоследних(
	|				&Дата,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						вр_ПС3.НомерСчета КАК НомерСчета
	|					ИЗ
	|						вр_ПС3 КАК вр_ПС3)) КАК уп_ЛицевыеСчетаУчастниковСрезПоследних
	|		ПО вр_ПС3.НомерСчета = уп_ЛицевыеСчетаУчастниковСрезПоследних.НомерСчета";

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборОрганизация%", "И уп_СостоянияПССрезПоследних.НомерСчета.Владелец.Организация = &Организация");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборОрганизация%", "");
	КонецЕсли;

	Запрос.УстановитьПараметр("Выплатное", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
	Запрос.УстановитьПараметр("Дата", Объект.ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("МинимальныйРазмерПенсии", Справочники.уп_ОбщиеПенсионныеПравила.МинРазмерСрочнойПенсии);

	ПериодичностьВыплатНеЕжемесячные = Новый Массив;
	ПериодичностьВыплатНеЕжемесячные.Добавить(Перечисления.уп_ПериодичностьВыплат.Ежегодно);
	ПериодичностьВыплатНеЕжемесячные.Добавить(Перечисления.уп_ПериодичностьВыплат.Ежеквартально);
	ПериодичностьВыплатНеЕжемесячные.Добавить(Перечисления.уп_ПериодичностьВыплат.Полугодие);
	Запрос.УстановитьПараметр("ПериодичностьВыплатНеЕжемесячные", ПериодичностьВыплатНеЕжемесячные);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Счетчик = 0;
	КолСтрокВТаблице = 20000;
	ДокРаспоряжение = Неопределено;

	Пока Выборка.Следующий() Цикл

		Если Счетчик = КолСтрокВТаблице Или ДокРаспоряжение = Неопределено Тогда

			Если Счетчик = КолСтрокВТаблице Тогда
				ДокРаспоряжение.Записать();
				НоваяСтрока = Объект.НовыеДокументы.Добавить();
				НоваяСтрока.Документ = ДокРаспоряжение.Ссылка;
				Счетчик = 0;
			КонецЕсли;

			ДокРаспоряжение = Документы.уп_Распоряжение.СоздатьДокумент();
			ДокРаспоряжение.Организация = Объект.Организация;
			ДокРаспоряжение.Дата = ?(ЗначениеЗаполнено(Объект.ДатаФормированияДокументов), Объект.ДатаФормированияДокументов, ТекущаяДатаСеанса());
			ДокРаспоряжение.Ответственный = Объект.Ответственный;

		КонецЕсли;

		Счетчик = Счетчик + 1;
		СтрокаТЧ = ДокРаспоряжение.СписокСчетов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		СтрокаТЧ.НачальнаяДата = ?(ЗначениеЗаполнено(Объект.ДатаФормированияДокументов), Объект.ДатаФормированияДокументов, ТекущаяДатаСеанса()); 

	КонецЦикла;

	Если ДокРаспоряжение<>Неопределено И ДокРаспоряжение.СписокСчетов.Количество() > 0 Тогда
		ДокРаспоряжение.Записать();
		НоваяСтрока = Объект.НовыеДокументы.Добавить();
		НоваяСтрока.Документ = ДокРаспоряжение.Ссылка;		
	КонецЕсли;

КонецПроцедуры
